SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM SHAPING10 */
#define _MODEM_SHAPING10_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_SHAPING10           */
#define _MODEM_SHAPING10_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_SHAPING10                    */
#define _MODEM_SHAPING10_COEFF40_SHIFT                          0                                        /**< Shift value for MODEM_COEFF40               */
#define _MODEM_SHAPING10_COEFF40_MASK                           0xFFUL                                   /**< Bit mask for MODEM_COEFF40                  */
#define _MODEM_SHAPING10_COEFF40_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING10            */
#define MODEM_SHAPING10_COEFF40_DEFAULT                         (_MODEM_SHAPING10_COEFF40_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SHAPING10    */
#define _MODEM_SHAPING10_COEFF41_SHIFT                          8                                        /**< Shift value for MODEM_COEFF41               */
#define _MODEM_SHAPING10_COEFF41_MASK                           0xFF00UL                                 /**< Bit mask for MODEM_COEFF41                  */
#define _MODEM_SHAPING10_COEFF41_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING10            */
#define MODEM_SHAPING10_COEFF41_DEFAULT                         (_MODEM_SHAPING10_COEFF41_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_SHAPING10    */
#define _MODEM_SHAPING10_COEFF42_SHIFT                          16                                       /**< Shift value for MODEM_COEFF42               */
#define _MODEM_SHAPING10_COEFF42_MASK                           0xFF0000UL                               /**< Bit mask for MODEM_COEFF42                  */
#define _MODEM_SHAPING10_COEFF42_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING10            */
#define MODEM_SHAPING10_COEFF42_DEFAULT                         (_MODEM_SHAPING10_COEFF42_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SHAPING10    */
#define _MODEM_SHAPING10_COEFF43_SHIFT                          24                                       /**< Shift value for MODEM_COEFF43               */
#define _MODEM_SHAPING10_COEFF43_MASK                           0xFF000000UL                             /**< Bit mask for MODEM_COEFF43                  */
#define _MODEM_SHAPING10_COEFF43_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING10            */
#define MODEM_SHAPING10_COEFF43_DEFAULT                         (_MODEM_SHAPING10_COEFF43_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_SHAPING10    */

/* Bit fields for MODEM SHAPING11 */
#define _MODEM_SHAPING11_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_SHAPING11           */
#define _MODEM_SHAPING11_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_SHAPING11                    */
#define _MODEM_SHAPING11_COEFF44_SHIFT                          0                                        /**< Shift value for MODEM_COEFF44               */
#define _MODEM_SHAPING11_COEFF44_MASK                           0xFFUL                                   /**< Bit mask for MODEM_COEFF44                  */
#define _MODEM_SHAPING11_COEFF44_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING11            */
#define MODEM_SHAPING11_COEFF44_DEFAULT                         (_MODEM_SHAPING11_COEFF44_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SHAPING11    */
#define _MODEM_SHAPING11_COEFF45_SHIFT                          8                                        /**< Shift value for MODEM_COEFF45               */
#define _MODEM_SHAPING11_COEFF45_MASK                           0xFF00UL                                 /**< Bit mask for MODEM_COEFF45                  */
#define _MODEM_SHAPING11_COEFF45_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING11            */
#define MODEM_SHAPING11_COEFF45_DEFAULT                         (_MODEM_SHAPING11_COEFF45_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_SHAPING11    */
#define _MODEM_SHAPING11_COEFF46_SHIFT                          16                                       /**< Shift value for MODEM_COEFF46               */
#define _MODEM_SHAPING11_COEFF46_MASK                           0xFF0000UL                               /**< Bit mask for MODEM_COEFF46                  */
#define _MODEM_SHAPING11_COEFF46_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING11            */
#define MODEM_SHAPING11_COEFF46_DEFAULT                         (_MODEM_SHAPING11_COEFF46_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SHAPING11    */
#define _MODEM_SHAPING11_COEFF47_SHIFT                          24                                       /**< Shift value for MODEM_COEFF47               */
#define _MODEM_SHAPING11_COEFF47_MASK                           0xFF000000UL                             /**< Bit mask for MODEM_COEFF47                  */
#define _MODEM_SHAPING11_COEFF47_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING11            */
#define MODEM_SHAPING11_COEFF47_DEFAULT                         (_MODEM_SHAPING11_COEFF47_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_SHAPING11    */

/* Bit fields for MODEM SHAPING12 */
#define _MODEM_SHAPING12_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_SHAPING12           */
#define _MODEM_SHAPING12_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_SHAPING12                    */
#define _MODEM_SHAPING12_COEFF48_SHIFT                          0                                        /**< Shift value for MODEM_COEFF48               */
#define _MODEM_SHAPING12_COEFF48_MASK                           0xFFUL                                   /**< Bit mask for MODEM_COEFF48                  */
#define _MODEM_SHAPING12_COEFF48_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING12            */
#define MODEM_SHAPING12_COEFF48_DEFAULT                         (_MODEM_SHAPING12_COEFF48_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SHAPING12    */
#define _MODEM_SHAPING12_COEFF49_SHIFT                          8                                        /**< Shift value for MODEM_COEFF49               */
#define _MODEM_SHAPING12_COEFF49_MASK                           0xFF00UL                                 /**< Bit mask for MODEM_COEFF49                  */
#define _MODEM_SHAPING12_COEFF49_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING12            */
#define MODEM_SHAPING12_COEFF49_DEFAULT                         (_MODEM_SHAPING12_COEFF49_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_SHAPING12    */
#define _MODEM_SHAPING12_COEFF50_SHIFT                          16                                       /**< Shift value for MODEM_COEFF50               */
#define _MODEM_SHAPING12_COEFF50_MASK                           0xFF0000UL                               /**< Bit mask for MODEM_COEFF50                  */
#define _MODEM_SHAPING12_COEFF50_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING12            */
#define MODEM_SHAPING12_COEFF50_DEFAULT                         (_MODEM_SHAPING12_COEFF50_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SHAPING12    */
#define _MODEM_SHAPING12_COEFF51_SHIFT                          24                                       /**< Shift value for MODEM_COEFF51               */
#define _MODEM_SHAPING12_COEFF51_MASK                           0xFF000000UL                             /**< Bit mask for MODEM_COEFF51                  */
#define _MODEM_SHAPING12_COEFF51_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING12            */
#define MODEM_SHAPING12_COEFF51_DEFAULT                         (_MODEM_SHAPING12_COEFF51_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_SHAPING12    */

/* Bit fields for MODEM SHAPING13 */
#define _MODEM_SHAPING13_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_SHAPING13           */
#define _MODEM_SHAPING13_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_SHAPING13                    */
#define _MODEM_SHAPING13_COEFF52_SHIFT                          0                                        /**< Shift value for MODEM_COEFF52               */
#define _MODEM_SHAPING13_COEFF52_MASK                           0xFFUL                                   /**< Bit mask for MODEM_COEFF52                  */
#define _MODEM_SHAPING13_COEFF52_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING13            */
#define MODEM_SHAPING13_COEFF52_DEFAULT                         (_MODEM_SHAPING13_COEFF52_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SHAPING13    */
#define _MODEM_SHAPING13_COEFF53_SHIFT                          8                                        /**< Shift value for MODEM_COEFF53               */
#define _MODEM_SHAPING13_COEFF53_MASK                           0xFF00UL                                 /**< Bit mask for MODEM_COEFF53                  */
#define _MODEM_SHAPING13_COEFF53_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING13            */
#define MODEM_SHAPING13_COEFF53_DEFAULT                         (_MODEM_SHAPING13_COEFF53_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_SHAPING13    */
#define _MODEM_SHAPING13_COEFF54_SHIFT                          16                                       /**< Shift value for MODEM_COEFF54               */
#define _MODEM_SHAPING13_COEFF54_MASK                           0xFF0000UL                               /**< Bit mask for MODEM_COEFF54                  */
#define _MODEM_SHAPING13_COEFF54_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING13            */
#define MODEM_SHAPING13_COEFF54_DEFAULT                         (_MODEM_SHAPING13_COEFF54_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SHAPING13    */
#define _MODEM_SHAPING13_COEFF55_SHIFT                          24                                       /**< Shift value for MODEM_COEFF55               */
#define _MODEM_SHAPING13_COEFF55_MASK                           0xFF000000UL                             /**< Bit mask for MODEM_COEFF55                  */
#define _MODEM_SHAPING13_COEFF55_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING13            */
#define MODEM_SHAPING13_COEFF55_DEFAULT                         (_MODEM_SHAPING13_COEFF55_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_SHAPING13    */

/* Bit fields for MODEM SHAPING14 */
#define _MODEM_SHAPING14_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_SHAPING14           */
#define _MODEM_SHAPING14_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_SHAPING14                    */
#define _MODEM_SHAPING14_COEFF56_SHIFT                          0                                        /**< Shift value for MODEM_COEFF56               */
#define _MODEM_SHAPING14_COEFF56_MASK                           0xFFUL                                   /**< Bit mask for MODEM_COEFF56                  */
#define _MODEM_SHAPING14_COEFF56_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING14            */
#define MODEM_SHAPING14_COEFF56_DEFAULT                         (_MODEM_SHAPING14_COEFF56_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SHAPING14    */
#define _MODEM_SHAPING14_COEFF57_SHIFT                          8                                        /**< Shift value for MODEM_COEFF57               */
#define _MODEM_SHAPING14_COEFF57_MASK                           0xFF00UL                                 /**< Bit mask for MODEM_COEFF57                  */
#define _MODEM_SHAPING14_COEFF57_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING14            */
#define MODEM_SHAPING14_COEFF57_DEFAULT                         (_MODEM_SHAPING14_COEFF57_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_SHAPING14    */
#define _MODEM_SHAPING14_COEFF58_SHIFT                          16                                       /**< Shift value for MODEM_COEFF58               */
#define _MODEM_SHAPING14_COEFF58_MASK                           0xFF0000UL                               /**< Bit mask for MODEM_COEFF58                  */
#define _MODEM_SHAPING14_COEFF58_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING14            */
#define MODEM_SHAPING14_COEFF58_DEFAULT                         (_MODEM_SHAPING14_COEFF58_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SHAPING14    */
#define _MODEM_SHAPING14_COEFF59_SHIFT                          24                                       /**< Shift value for MODEM_COEFF59               */
#define _MODEM_SHAPING14_COEFF59_MASK                           0xFF000000UL                             /**< Bit mask for MODEM_COEFF59                  */
#define _MODEM_SHAPING14_COEFF59_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING14            */
#define MODEM_SHAPING14_COEFF59_DEFAULT                         (_MODEM_SHAPING14_COEFF59_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_SHAPING14    */

/* Bit fields for MODEM SHAPING15 */
#define _MODEM_SHAPING15_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_SHAPING15           */
#define _MODEM_SHAPING15_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_SHAPING15                    */
#define _MODEM_SHAPING15_COEFF60_SHIFT                          0                                        /**< Shift value for MODEM_COEFF60               */
#define _MODEM_SHAPING15_COEFF60_MASK                           0xFFUL                                   /**< Bit mask for MODEM_COEFF60                  */
#define _MODEM_SHAPING15_COEFF60_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING15            */
#define MODEM_SHAPING15_COEFF60_DEFAULT                         (_MODEM_SHAPING15_COEFF60_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SHAPING15    */
#define _MODEM_SHAPING15_COEFF61_SHIFT                          8                                        /**< Shift value for MODEM_COEFF61               */
#define _MODEM_SHAPING15_COEFF61_MASK                           0xFF00UL                                 /**< Bit mask for MODEM_COEFF61                  */
#define _MODEM_SHAPING15_COEFF61_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING15            */
#define MODEM_SHAPING15_COEFF61_DEFAULT                         (_MODEM_SHAPING15_COEFF61_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_SHAPING15    */
#define _MODEM_SHAPING15_COEFF62_SHIFT                          16                                       /**< Shift value for MODEM_COEFF62               */
#define _MODEM_SHAPING15_COEFF62_MASK                           0xFF0000UL                               /**< Bit mask for MODEM_COEFF62                  */
#define _MODEM_SHAPING15_COEFF62_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING15            */
#define MODEM_SHAPING15_COEFF62_DEFAULT                         (_MODEM_SHAPING15_COEFF62_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SHAPING15    */
#define _MODEM_SHAPING15_COEFF63_SHIFT                          24                                       /**< Shift value for MODEM_COEFF63               */
#define _MODEM_SHAPING15_COEFF63_MASK                           0xFF000000UL                             /**< Bit mask for MODEM_COEFF63                  */
#define _MODEM_SHAPING15_COEFF63_DEFAULT                        0x00000000UL                             /**< Mode DEFAULT for MODEM_SHAPING15            */
#define MODEM_SHAPING15_COEFF63_DEFAULT                         (_MODEM_SHAPING15_COEFF63_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_SHAPING15    */

/* Bit fields for MODEM OOKSHAPING */
#define _MODEM_OOKSHAPING_RESETVALUE                            0x00000000UL                                        /**< Default value for MODEM_OOKSHAPING          */
#define _MODEM_OOKSHAPING_MASK                                  0x0007FFFFUL                                        /**< Mask for MODEM_OOKSHAPING                   */
#define MODEM_OOKSHAPING_OOKSHAPINGEN                           (0x1UL << 0)                                        /**< OOK/ASK PA Shaping Enable                   */
#define _MODEM_OOKSHAPING_OOKSHAPINGEN_SHIFT                    0                                                   /**< Shift value for MODEM_OOKSHAPINGEN          */
#define _MODEM_OOKSHAPING_OOKSHAPINGEN_MASK                     0x1UL                                               /**< Bit mask for MODEM_OOKSHAPINGEN             */
#define _MODEM_OOKSHAPING_OOKSHAPINGEN_DEFAULT                  0x00000000UL                                        /**< Mode DEFAULT for MODEM_OOKSHAPING           */
#define MODEM_OOKSHAPING_OOKSHAPINGEN_DEFAULT                   (_MODEM_OOKSHAPING_OOKSHAPINGEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_OOKSHAPING   */
#define _MODEM_OOKSHAPING_OOKSHAPINGSTEP_SHIFT                  1                                                   /**< Shift value for MODEM_OOKSHAPINGSTEP        */
#define _MODEM_OOKSHAPING_OOKSHAPINGSTEP_MASK                   0x3FEUL                                             /**< Bit mask for MODEM_OOKSHAPINGSTEP           */
#define _MODEM_OOKSHAPING_OOKSHAPINGSTEP_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for MODEM_OOKSHAPING           */
#define MODEM_OOKSHAPING_OOKSHAPINGSTEP_DEFAULT                 (_MODEM_OOKSHAPING_OOKSHAPINGSTEP_DEFAULT << 1)     /**< Shifted mode DEFAULT for MODEM_OOKSHAPING   */
#define _MODEM_OOKSHAPING_OOKSHAPINGRATE_SHIFT                  10                                                  /**< Shift value for MODEM_OOKSHAPINGRATE        */
#define _MODEM_OOKSHAPING_OOKSHAPINGRATE_MASK                   0x1C00UL                                            /**< Bit mask for MODEM_OOKSHAPINGRATE           */
#define _MODEM_OOKSHAPING_OOKSHAPINGRATE_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for MODEM_OOKSHAPING           */
#define MODEM_OOKSHAPING_OOKSHAPINGRATE_DEFAULT                 (_MODEM_OOKSHAPING_OOKSHAPINGRATE_DEFAULT << 10)    /**< Shifted mode DEFAULT for MODEM_OOKSHAPING   */
#define _MODEM_OOKSHAPING_OOKSHAPINGLUTSIZE_SHIFT               13                                                  /**< Shift value for MODEM_OOKSHAPINGLUTSIZE     */
#define _MODEM_OOKSHAPING_OOKSHAPINGLUTSIZE_MASK                0x7E000UL                                           /**< Bit mask for MODEM_OOKSHAPINGLUTSIZE        */
#define _MODEM_OOKSHAPING_OOKSHAPINGLUTSIZE_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for MODEM_OOKSHAPING           */
#define MODEM_OOKSHAPING_OOKSHAPINGLUTSIZE_DEFAULT              (_MODEM_OOKSHAPING_OOKSHAPINGLUTSIZE_DEFAULT << 13) /**< Shifted mode DEFAULT for MODEM_OOKSHAPING   */

/* Bit fields for MODEM RAMPCTRL */
#define _MODEM_RAMPCTRL_RESETVALUE                              0x00000555UL                             /**< Default value for MODEM_RAMPCTRL            */
#define _MODEM_RAMPCTRL_MASK                                    0x00FF1FFFUL                             /**< Mask for MODEM_RAMPCTRL                     */
#define _MODEM_RAMPCTRL_RAMPRATE0_SHIFT                         0                                        /**< Shift value for MODEM_RAMPRATE0             */
#define _MODEM_RAMPCTRL_RAMPRATE0_MASK                          0xFUL                                    /**< Bit mask for MODEM_RAMPRATE0                */
#define _MODEM_RAMPCTRL_RAMPRATE0_DEFAULT                       0x00000005UL                             /**< Mode DEFAULT for MODEM_RAMPCTRL             */
#define MODEM_RAMPCTRL_RAMPRATE0_DEFAULT                        (_MODEM_RAMPCTRL_RAMPRATE0_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_RAMPCTRL     */
#define _MODEM_RAMPCTRL_RAMPRATE1_SHIFT                         4                                        /**< Shift value for MODEM_RAMPRATE1             */
#define _MODEM_RAMPCTRL_RAMPRATE1_MASK                          0xF0UL                                   /**< Bit mask for MODEM_RAMPRATE1                */
#define _MODEM_RAMPCTRL_RAMPRATE1_DEFAULT                       0x00000005UL                             /**< Mode DEFAULT for MODEM_RAMPCTRL             */
#define MODEM_RAMPCTRL_RAMPRATE1_DEFAULT                        (_MODEM_RAMPCTRL_RAMPRATE1_DEFAULT << 4) /**< Shifted mode DEFAULT for MODEM_RAMPCTRL     */
#define _MODEM_RAMPCTRL_RAMPRATE2_SHIFT                         8                                        /**< Shift value for MODEM_RAMPRATE2             */
#define _MODEM_RAMPCTRL_RAMPRATE2_MASK                          0xF00UL                                  /**< Bit mask for MODEM_RAMPRATE2                */
#define _MODEM_RAMPCTRL_RAMPRATE2_DEFAULT                       0x00000005UL                             /**< Mode DEFAULT for MODEM_RAMPCTRL             */
#define MODEM_RAMPCTRL_RAMPRATE2_DEFAULT                        (_MODEM_RAMPCTRL_RAMPRATE2_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_RAMPCTRL     */

