SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM ANTDIVCTRL */
#define _MODEM_ANTDIVCTRL_RESETVALUE                            0x00000000UL                                   /**< Default value for MODEM_ANTDIVCTRL          */
#define _MODEM_ANTDIVCTRL_MASK                                  0x000007FFUL                                   /**< Mask for MODEM_ANTDIVCTRL                   */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_SHIFT                     0                                              /**< Shift value for MODEM_ADPRETHRESH           */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_MASK                      0xFFUL                                         /**< Bit mask for MODEM_ADPRETHRESH              */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT                    (_MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH                          (0x1UL << 8)                                   /**< Enable Preamble threshold                   */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_SHIFT                   8                                              /**< Shift value for MODEM_ENADPRETHRESH         */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_MASK                    0x100UL                                        /**< Bit mask for MODEM_ENADPRETHRESH            */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE                 0x00000000UL                                   /**< Mode DISABLE for MODEM_ANTDIVCTRL           */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE                  0x00000001UL                                   /**< Mode ENABLE for MODEM_ANTDIVCTRL            */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT                  (_MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE                  (_MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE << 8) /**< Shifted mode DISABLE for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE                   (_MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE << 8)  /**< Shifted mode ENABLE for MODEM_ANTDIVCTRL    */
#define MODEM_ANTDIVCTRL_ANTDIVDISCCA                           (0x1UL << 9)                                   /**< Antenna switch disable for CSMA             */
#define _MODEM_ANTDIVCTRL_ANTDIVDISCCA_SHIFT                    9                                              /**< Shift value for MODEM_ANTDIVDISCCA          */
#define _MODEM_ANTDIVCTRL_ANTDIVDISCCA_MASK                     0x200UL                                        /**< Bit mask for MODEM_ANTDIVDISCCA             */
#define _MODEM_ANTDIVCTRL_ANTDIVDISCCA_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ANTDIVDISCCA_DEFAULT                   (_MODEM_ANTDIVCTRL_ANTDIVDISCCA_DEFAULT << 9)  /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ANTDIVSELCCA                           (0x1UL << 10)                                  /**< Antenna switch selection for CSMA           */
#define _MODEM_ANTDIVCTRL_ANTDIVSELCCA_SHIFT                    10                                             /**< Shift value for MODEM_ANTDIVSELCCA          */
#define _MODEM_ANTDIVCTRL_ANTDIVSELCCA_MASK                     0x400UL                                        /**< Bit mask for MODEM_ANTDIVSELCCA             */
#define _MODEM_ANTDIVCTRL_ANTDIVSELCCA_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ANTDIVSELCCA_DEFAULT                   (_MODEM_ANTDIVCTRL_ANTDIVSELCCA_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */

/* Bit fields for MODEM ANTDIVFW */
#define _MODEM_ANTDIVFW_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_ANTDIVFW            */
#define _MODEM_ANTDIVFW_MASK                                    0x80000003UL                               /**< Mask for MODEM_ANTDIVFW                     */
#define MODEM_ANTDIVFW_FWSELANT                                 (0x1UL << 0)                               /**< FW antenna selection                        */
#define _MODEM_ANTDIVFW_FWSELANT_SHIFT                          0                                          /**< Shift value for MODEM_FWSELANT              */
#define _MODEM_ANTDIVFW_FWSELANT_MASK                           0x1UL                                      /**< Bit mask for MODEM_FWSELANT                 */
#define _MODEM_ANTDIVFW_FWSELANT_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for MODEM_ANTDIVFW             */
#define MODEM_ANTDIVFW_FWSELANT_DEFAULT                         (_MODEM_ANTDIVFW_FWSELANT_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_ANTDIVFW     */
#define MODEM_ANTDIVFW_FWANTSWCMD                               (0x1UL << 1)                               /**< FW Antenna SW cmd                           */
#define _MODEM_ANTDIVFW_FWANTSWCMD_SHIFT                        1                                          /**< Shift value for MODEM_FWANTSWCMD            */
#define _MODEM_ANTDIVFW_FWANTSWCMD_MASK                         0x2UL                                      /**< Bit mask for MODEM_FWANTSWCMD               */
#define _MODEM_ANTDIVFW_FWANTSWCMD_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_ANTDIVFW             */
#define MODEM_ANTDIVFW_FWANTSWCMD_DEFAULT                       (_MODEM_ANTDIVFW_FWANTSWCMD_DEFAULT << 1)  /**< Shifted mode DEFAULT for MODEM_ANTDIVFW     */
#define MODEM_ANTDIVFW_FWANTDIVEN                               (0x1UL << 31)                              /**< Enable FW ANT-DIV mode                      */
#define _MODEM_ANTDIVFW_FWANTDIVEN_SHIFT                        31                                         /**< Shift value for MODEM_FWANTDIVEN            */
#define _MODEM_ANTDIVFW_FWANTDIVEN_MASK                         0x80000000UL                               /**< Bit mask for MODEM_FWANTDIVEN               */
#define _MODEM_ANTDIVFW_FWANTDIVEN_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_ANTDIVFW             */
#define MODEM_ANTDIVFW_FWANTDIVEN_DEFAULT                       (_MODEM_ANTDIVFW_FWANTDIVEN_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_ANTDIVFW     */

/* Bit fields for MODEM PHDMODANTDIV */
#define _MODEM_PHDMODANTDIV_RESETVALUE                          0x0000000FUL                                    /**< Default value for MODEM_PHDMODANTDIV        */
#define _MODEM_PHDMODANTDIV_MASK                                0x40FF1FFFUL                                    /**< Mask for MODEM_PHDMODANTDIV                 */
#define _MODEM_PHDMODANTDIV_ANTWAIT_SHIFT                       0                                               /**< Shift value for MODEM_ANTWAIT               */
#define _MODEM_PHDMODANTDIV_ANTWAIT_MASK                        0x1FUL                                          /**< Bit mask for MODEM_ANTWAIT                  */
#define _MODEM_PHDMODANTDIV_ANTWAIT_DEFAULT                     0x0000000FUL                                    /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_ANTWAIT_DEFAULT                      (_MODEM_PHDMODANTDIV_ANTWAIT_DEFAULT << 0)      /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define _MODEM_PHDMODANTDIV_SKIPRSSITHD_SHIFT                   5                                               /**< Shift value for MODEM_SKIPRSSITHD           */
#define _MODEM_PHDMODANTDIV_SKIPRSSITHD_MASK                    0x1FE0UL                                        /**< Bit mask for MODEM_SKIPRSSITHD              */
#define _MODEM_PHDMODANTDIV_SKIPRSSITHD_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIPRSSITHD_DEFAULT                  (_MODEM_PHDMODANTDIV_SKIPRSSITHD_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define _MODEM_PHDMODANTDIV_SKIPCORRTHD_SHIFT                   16                                              /**< Shift value for MODEM_SKIPCORRTHD           */
#define _MODEM_PHDMODANTDIV_SKIPCORRTHD_MASK                    0xFF0000UL                                      /**< Bit mask for MODEM_SKIPCORRTHD              */
#define _MODEM_PHDMODANTDIV_SKIPCORRTHD_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIPCORRTHD_DEFAULT                  (_MODEM_PHDMODANTDIV_SKIPCORRTHD_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define MODEM_PHDMODANTDIV_SKIP2ANT                             (0x1UL << 30)                                   /**< SKIP 2th  ANTENNA Evaluate                  */
#define _MODEM_PHDMODANTDIV_SKIP2ANT_SHIFT                      30                                              /**< Shift value for MODEM_SKIP2ANT              */
#define _MODEM_PHDMODANTDIV_SKIP2ANT_MASK                       0x40000000UL                                    /**< Bit mask for MODEM_SKIP2ANT                 */
#define _MODEM_PHDMODANTDIV_SKIP2ANT_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIP2ANT_DEFAULT                     (_MODEM_PHDMODANTDIV_SKIP2ANT_DEFAULT << 30)    /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */

/* Bit fields for MODEM PHANTDECSION */
#define _MODEM_PHANTDECSION_RESETVALUE                          0x00000000UL                                      /**< Default value for MODEM_PHANTDECSION        */
#define _MODEM_PHANTDECSION_MASK                                0xF007FFFFUL                                      /**< Mask for MODEM_PHANTDECSION                 */
#define _MODEM_PHANTDECSION_CORRANDDIVTHD_SHIFT                 0                                                 /**< Shift value for MODEM_CORRANDDIVTHD         */
#define _MODEM_PHANTDECSION_CORRANDDIVTHD_MASK                  0x3FFUL                                           /**< Bit mask for MODEM_CORRANDDIVTHD            */
#define _MODEM_PHANTDECSION_CORRANDDIVTHD_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_CORRANDDIVTHD_DEFAULT                (_MODEM_PHANTDECSION_CORRANDDIVTHD_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define _MODEM_PHANTDECSION_RSSIANDDIVTHD_SHIFT                 10                                                /**< Shift value for MODEM_RSSIANDDIVTHD         */
#define _MODEM_PHANTDECSION_RSSIANDDIVTHD_MASK                  0x7FC00UL                                         /**< Bit mask for MODEM_RSSIANDDIVTHD            */
#define _MODEM_PHANTDECSION_RSSIANDDIVTHD_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSIANDDIVTHD_DEFAULT                (_MODEM_PHANTDECSION_RSSIANDDIVTHD_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR0                            (0x1UL << 28)                                     /**< RSSI-CORR  Selection in Region0             */
#define _MODEM_PHANTDECSION_RSSICORR0_SHIFT                     28                                                /**< Shift value for MODEM_RSSICORR0             */
#define _MODEM_PHANTDECSION_RSSICORR0_MASK                      0x10000000UL                                      /**< Bit mask for MODEM_RSSICORR0                */
#define _MODEM_PHANTDECSION_RSSICORR0_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR0_DEFAULT                    (_MODEM_PHANTDECSION_RSSICORR0_DEFAULT << 28)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR1                            (0x1UL << 29)                                     /**< RSSI-CORR  Selection in Region1             */
#define _MODEM_PHANTDECSION_RSSICORR1_SHIFT                     29                                                /**< Shift value for MODEM_RSSICORR1             */
#define _MODEM_PHANTDECSION_RSSICORR1_MASK                      0x20000000UL                                      /**< Bit mask for MODEM_RSSICORR1                */
#define _MODEM_PHANTDECSION_RSSICORR1_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR1_DEFAULT                    (_MODEM_PHANTDECSION_RSSICORR1_DEFAULT << 29)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR2                            (0x1UL << 30)                                     /**< RSSI-CORR  Selection in Region2             */
#define _MODEM_PHANTDECSION_RSSICORR2_SHIFT                     30                                                /**< Shift value for MODEM_RSSICORR2             */
#define _MODEM_PHANTDECSION_RSSICORR2_MASK                      0x40000000UL                                      /**< Bit mask for MODEM_RSSICORR2                */
#define _MODEM_PHANTDECSION_RSSICORR2_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR2_DEFAULT                    (_MODEM_PHANTDECSION_RSSICORR2_DEFAULT << 30)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR3                            (0x1UL << 31)                                     /**< RSSI-CORR  Selection in Region3             */
#define _MODEM_PHANTDECSION_RSSICORR3_SHIFT                     31                                                /**< Shift value for MODEM_RSSICORR3             */
#define _MODEM_PHANTDECSION_RSSICORR3_MASK                      0x80000000UL                                      /**< Bit mask for MODEM_RSSICORR3                */
#define _MODEM_PHANTDECSION_RSSICORR3_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR3_DEFAULT                    (_MODEM_PHANTDECSION_RSSICORR3_DEFAULT << 31)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */

