SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM ADFSM8 */
#define _MODEM_ADFSM8_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_ADFSM8              */
#define _MODEM_ADFSM8_MASK                                      0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM8                       */
#define _MODEM_ADFSM8_ADNEXTSTATESW4_SHIFT                      0                                            /**< Shift value for MODEM_ADNEXTSTATESW4        */
#define _MODEM_ADFSM8_ADNEXTSTATESW4_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADNEXTSTATESW4           */
#define _MODEM_ADFSM8_ADNEXTSTATESW4_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM8               */
#define MODEM_ADFSM8_ADNEXTSTATESW4_DEFAULT                     (_MODEM_ADFSM8_ADNEXTSTATESW4_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM8       */
#define _MODEM_ADFSM8_ADNEXTSTATESW5_SHIFT                      16                                           /**< Shift value for MODEM_ADNEXTSTATESW5        */
#define _MODEM_ADFSM8_ADNEXTSTATESW5_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADNEXTSTATESW5           */
#define _MODEM_ADFSM8_ADNEXTSTATESW5_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM8               */
#define MODEM_ADFSM8_ADNEXTSTATESW5_DEFAULT                     (_MODEM_ADFSM8_ADNEXTSTATESW5_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM8       */

/* Bit fields for MODEM ADFSM9 */
#define _MODEM_ADFSM9_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_ADFSM9              */
#define _MODEM_ADFSM9_MASK                                      0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM9                       */
#define _MODEM_ADFSM9_ADNEXTSTATESW6_SHIFT                      0                                            /**< Shift value for MODEM_ADNEXTSTATESW6        */
#define _MODEM_ADFSM9_ADNEXTSTATESW6_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADNEXTSTATESW6           */
#define _MODEM_ADFSM9_ADNEXTSTATESW6_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM9               */
#define MODEM_ADFSM9_ADNEXTSTATESW6_DEFAULT                     (_MODEM_ADFSM9_ADNEXTSTATESW6_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM9       */
#define _MODEM_ADFSM9_ADNEXTSTATESW7_SHIFT                      16                                           /**< Shift value for MODEM_ADNEXTSTATESW7        */
#define _MODEM_ADFSM9_ADNEXTSTATESW7_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADNEXTSTATESW7           */
#define _MODEM_ADFSM9_ADNEXTSTATESW7_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM9               */
#define MODEM_ADFSM9_ADNEXTSTATESW7_DEFAULT                     (_MODEM_ADFSM9_ADNEXTSTATESW7_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM9       */

/* Bit fields for MODEM ADFSM10 */
#define _MODEM_ADFSM10_RESETVALUE                               0x00000000UL                                  /**< Default value for MODEM_ADFSM10             */
#define _MODEM_ADFSM10_MASK                                     0xFFFFFFFFUL                                  /**< Mask for MODEM_ADFSM10                      */
#define _MODEM_ADFSM10_ADNEXTSTATESW8_SHIFT                     0                                             /**< Shift value for MODEM_ADNEXTSTATESW8        */
#define _MODEM_ADFSM10_ADNEXTSTATESW8_MASK                      0xFFFFUL                                      /**< Bit mask for MODEM_ADNEXTSTATESW8           */
#define _MODEM_ADFSM10_ADNEXTSTATESW8_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM10              */
#define MODEM_ADFSM10_ADNEXTSTATESW8_DEFAULT                    (_MODEM_ADFSM10_ADNEXTSTATESW8_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM10      */
#define _MODEM_ADFSM10_ADNEXTSTATESW9_SHIFT                     16                                            /**< Shift value for MODEM_ADNEXTSTATESW9        */
#define _MODEM_ADFSM10_ADNEXTSTATESW9_MASK                      0xFFFF0000UL                                  /**< Bit mask for MODEM_ADNEXTSTATESW9           */
#define _MODEM_ADFSM10_ADNEXTSTATESW9_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM10              */
#define MODEM_ADFSM10_ADNEXTSTATESW9_DEFAULT                    (_MODEM_ADFSM10_ADNEXTSTATESW9_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM10      */

/* Bit fields for MODEM ADFSM11 */
#define _MODEM_ADFSM11_RESETVALUE                               0x00000000UL                                   /**< Default value for MODEM_ADFSM11             */
#define _MODEM_ADFSM11_MASK                                     0xFFFFFFFFUL                                   /**< Mask for MODEM_ADFSM11                      */
#define _MODEM_ADFSM11_ADNEXTSTATESW10_SHIFT                    0                                              /**< Shift value for MODEM_ADNEXTSTATESW10       */
#define _MODEM_ADFSM11_ADNEXTSTATESW10_MASK                     0xFFFFUL                                       /**< Bit mask for MODEM_ADNEXTSTATESW10          */
#define _MODEM_ADFSM11_ADNEXTSTATESW10_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM11              */
#define MODEM_ADFSM11_ADNEXTSTATESW10_DEFAULT                   (_MODEM_ADFSM11_ADNEXTSTATESW10_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM11      */
#define _MODEM_ADFSM11_ADNEXTSTATESW11_SHIFT                    16                                             /**< Shift value for MODEM_ADNEXTSTATESW11       */
#define _MODEM_ADFSM11_ADNEXTSTATESW11_MASK                     0xFFFF0000UL                                   /**< Bit mask for MODEM_ADNEXTSTATESW11          */
#define _MODEM_ADFSM11_ADNEXTSTATESW11_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM11              */
#define MODEM_ADFSM11_ADNEXTSTATESW11_DEFAULT                   (_MODEM_ADFSM11_ADNEXTSTATESW11_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM11      */

/* Bit fields for MODEM ADFSM12 */
#define _MODEM_ADFSM12_RESETVALUE                               0x00000000UL                                   /**< Default value for MODEM_ADFSM12             */
#define _MODEM_ADFSM12_MASK                                     0xFFFFFFFFUL                                   /**< Mask for MODEM_ADFSM12                      */
#define _MODEM_ADFSM12_ADNEXTSTATESW12_SHIFT                    0                                              /**< Shift value for MODEM_ADNEXTSTATESW12       */
#define _MODEM_ADFSM12_ADNEXTSTATESW12_MASK                     0xFFFFUL                                       /**< Bit mask for MODEM_ADNEXTSTATESW12          */
#define _MODEM_ADFSM12_ADNEXTSTATESW12_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM12              */
#define MODEM_ADFSM12_ADNEXTSTATESW12_DEFAULT                   (_MODEM_ADFSM12_ADNEXTSTATESW12_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM12      */
#define _MODEM_ADFSM12_ADNEXTSTATESW13_SHIFT                    16                                             /**< Shift value for MODEM_ADNEXTSTATESW13       */
#define _MODEM_ADFSM12_ADNEXTSTATESW13_MASK                     0xFFFF0000UL                                   /**< Bit mask for MODEM_ADNEXTSTATESW13          */
#define _MODEM_ADFSM12_ADNEXTSTATESW13_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM12              */
#define MODEM_ADFSM12_ADNEXTSTATESW13_DEFAULT                   (_MODEM_ADFSM12_ADNEXTSTATESW13_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM12      */

/* Bit fields for MODEM ADFSM13 */
#define _MODEM_ADFSM13_RESETVALUE                               0x00000000UL                                   /**< Default value for MODEM_ADFSM13             */
#define _MODEM_ADFSM13_MASK                                     0xFFFFFFFFUL                                   /**< Mask for MODEM_ADFSM13                      */
#define _MODEM_ADFSM13_ADNEXTSTATESW14_SHIFT                    0                                              /**< Shift value for MODEM_ADNEXTSTATESW14       */
#define _MODEM_ADFSM13_ADNEXTSTATESW14_MASK                     0xFFFFUL                                       /**< Bit mask for MODEM_ADNEXTSTATESW14          */
#define _MODEM_ADFSM13_ADNEXTSTATESW14_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM13              */
#define MODEM_ADFSM13_ADNEXTSTATESW14_DEFAULT                   (_MODEM_ADFSM13_ADNEXTSTATESW14_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM13      */
#define _MODEM_ADFSM13_ADNEXTSTATESW15_SHIFT                    16                                             /**< Shift value for MODEM_ADNEXTSTATESW15       */
#define _MODEM_ADFSM13_ADNEXTSTATESW15_MASK                     0xFFFF0000UL                                   /**< Bit mask for MODEM_ADNEXTSTATESW15          */
#define _MODEM_ADFSM13_ADNEXTSTATESW15_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM13              */
#define MODEM_ADFSM13_ADNEXTSTATESW15_DEFAULT                   (_MODEM_ADFSM13_ADNEXTSTATESW15_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM13      */

/* Bit fields for MODEM ADFSM14 */
#define _MODEM_ADFSM14_RESETVALUE                               0x00000000UL                                 /**< Default value for MODEM_ADFSM14             */
#define _MODEM_ADFSM14_MASK                                     0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM14                      */
#define _MODEM_ADFSM14_ADFSMCOND0ENA_SHIFT                      0                                            /**< Shift value for MODEM_ADFSMCOND0ENA         */
#define _MODEM_ADFSM14_ADFSMCOND0ENA_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND0ENA            */
#define _MODEM_ADFSM14_ADFSMCOND0ENA_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM14              */
#define MODEM_ADFSM14_ADFSMCOND0ENA_DEFAULT                     (_MODEM_ADFSM14_ADFSMCOND0ENA_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM14      */
#define _MODEM_ADFSM14_ADFSMCOND1ENA_SHIFT                      16                                           /**< Shift value for MODEM_ADFSMCOND1ENA         */
#define _MODEM_ADFSM14_ADFSMCOND1ENA_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND1ENA            */
#define _MODEM_ADFSM14_ADFSMCOND1ENA_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM14              */
#define MODEM_ADFSM14_ADFSMCOND1ENA_DEFAULT                     (_MODEM_ADFSM14_ADFSMCOND1ENA_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM14      */

/* Bit fields for MODEM ADFSM15 */
#define _MODEM_ADFSM15_RESETVALUE                               0x00000000UL                                 /**< Default value for MODEM_ADFSM15             */
#define _MODEM_ADFSM15_MASK                                     0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM15                      */
#define _MODEM_ADFSM15_ADFSMCOND2ENA_SHIFT                      0                                            /**< Shift value for MODEM_ADFSMCOND2ENA         */
#define _MODEM_ADFSM15_ADFSMCOND2ENA_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND2ENA            */
#define _MODEM_ADFSM15_ADFSMCOND2ENA_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM15              */
#define MODEM_ADFSM15_ADFSMCOND2ENA_DEFAULT                     (_MODEM_ADFSM15_ADFSMCOND2ENA_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM15      */
#define _MODEM_ADFSM15_ADFSMCOND3ENA_SHIFT                      16                                           /**< Shift value for MODEM_ADFSMCOND3ENA         */
#define _MODEM_ADFSM15_ADFSMCOND3ENA_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND3ENA            */
#define _MODEM_ADFSM15_ADFSMCOND3ENA_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM15              */
#define MODEM_ADFSM15_ADFSMCOND3ENA_DEFAULT                     (_MODEM_ADFSM15_ADFSMCOND3ENA_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM15      */

