SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM ADFSM30 */
#define _MODEM_ADFSM30_RESETVALUE                               0x00000000UL                                /**< Default value for MODEM_ADFSM30             */
#define _MODEM_ADFSM30_MASK                                     0xFFFFFFFFUL                                /**< Mask for MODEM_ADFSM30                      */
#define _MODEM_ADFSM30_ADODEMODRXREQ_SHIFT                      0                                           /**< Shift value for MODEM_ADODEMODRXREQ         */
#define _MODEM_ADFSM30_ADODEMODRXREQ_MASK                       0xFFFFFFFFUL                                /**< Bit mask for MODEM_ADODEMODRXREQ            */
#define _MODEM_ADFSM30_ADODEMODRXREQ_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for MODEM_ADFSM30              */
#define MODEM_ADFSM30_ADODEMODRXREQ_DEFAULT                     (_MODEM_ADFSM30_ADODEMODRXREQ_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM30      */

/* Bit fields for MODEM BCRCTRL0 */
#define _MODEM_BCRCTRL0_RESETVALUE                              0x08857628UL                                /**< Default value for MODEM_BCRCTRL0            */
#define _MODEM_BCRCTRL0_MASK                                    0xFFFFFFFFUL                                /**< Mask for MODEM_BCRCTRL0                     */
#define _MODEM_BCRCTRL0_BCRNCOFF_SHIFT                          0                                           /**< Shift value for MODEM_BCRNCOFF              */
#define _MODEM_BCRCTRL0_BCRNCOFF_MASK                           0x3FFFFFUL                                  /**< Bit mask for MODEM_BCRNCOFF                 */
#define _MODEM_BCRCTRL0_BCRNCOFF_DEFAULT                        0x00057628UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_BCRNCOFF_DEFAULT                         (_MODEM_BCRCTRL0_BCRNCOFF_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */
#define MODEM_BCRCTRL0_BCRERRRSTEN                              (0x1UL << 22)                               /**< BCRERRRSTEN                                 */
#define _MODEM_BCRCTRL0_BCRERRRSTEN_SHIFT                       22                                          /**< Shift value for MODEM_BCRERRRSTEN           */
#define _MODEM_BCRCTRL0_BCRERRRSTEN_MASK                        0x400000UL                                  /**< Bit mask for MODEM_BCRERRRSTEN              */
#define _MODEM_BCRCTRL0_BCRERRRSTEN_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_BCRERRRSTEN_DEFAULT                      (_MODEM_BCRCTRL0_BCRERRRSTEN_DEFAULT << 22) /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */
#define MODEM_BCRCTRL0_BCRFBBYP                                 (0x1UL << 23)                               /**< BCRFBBYP                                    */
#define _MODEM_BCRCTRL0_BCRFBBYP_SHIFT                          23                                          /**< Shift value for MODEM_BCRFBBYP              */
#define _MODEM_BCRCTRL0_BCRFBBYP_MASK                           0x800000UL                                  /**< Bit mask for MODEM_BCRFBBYP                 */
#define _MODEM_BCRCTRL0_BCRFBBYP_DEFAULT                        0x00000001UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_BCRFBBYP_DEFAULT                         (_MODEM_BCRCTRL0_BCRFBBYP_DEFAULT << 23)    /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */
#define MODEM_BCRCTRL0_BCRALIGN                                 (0x1UL << 24)                               /**< BCRALIGN                                    */
#define _MODEM_BCRCTRL0_BCRALIGN_SHIFT                          24                                          /**< Shift value for MODEM_BCRALIGN              */
#define _MODEM_BCRCTRL0_BCRALIGN_MASK                           0x1000000UL                                 /**< Bit mask for MODEM_BCRALIGN                 */
#define _MODEM_BCRCTRL0_BCRALIGN_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_BCRALIGN_DEFAULT                         (_MODEM_BCRCTRL0_BCRALIGN_DEFAULT << 24)    /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */
#define MODEM_BCRCTRL0_DISTOGG                                  (0x1UL << 25)                               /**< DISTOGG                                     */
#define _MODEM_BCRCTRL0_DISTOGG_SHIFT                           25                                          /**< Shift value for MODEM_DISTOGG               */
#define _MODEM_BCRCTRL0_DISTOGG_MASK                            0x2000000UL                                 /**< Bit mask for MODEM_DISTOGG                  */
#define _MODEM_BCRCTRL0_DISTOGG_DEFAULT                         0x00000000UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_DISTOGG_DEFAULT                          (_MODEM_BCRCTRL0_DISTOGG_DEFAULT << 25)     /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */
#define _MODEM_BCRCTRL0_CRSLOW_SHIFT                            26                                          /**< Shift value for MODEM_CRSLOW                */
#define _MODEM_BCRCTRL0_CRSLOW_MASK                             0x1C000000UL                                /**< Bit mask for MODEM_CRSLOW                   */
#define _MODEM_BCRCTRL0_CRSLOW_DEFAULT                          0x00000002UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_CRSLOW_DEFAULT                           (_MODEM_BCRCTRL0_CRSLOW_DEFAULT << 26)      /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */
#define _MODEM_BCRCTRL0_CRFAST_SHIFT                            29                                          /**< Shift value for MODEM_CRFAST                */
#define _MODEM_BCRCTRL0_CRFAST_MASK                             0xE0000000UL                                /**< Bit mask for MODEM_CRFAST                   */
#define _MODEM_BCRCTRL0_CRFAST_DEFAULT                          0x00000000UL                                /**< Mode DEFAULT for MODEM_BCRCTRL0             */
#define MODEM_BCRCTRL0_CRFAST_DEFAULT                           (_MODEM_BCRCTRL0_CRFAST_DEFAULT << 29)      /**< Shifted mode DEFAULT for MODEM_BCRCTRL0     */

/* Bit fields for MODEM BCRCTRL1 */
#define _MODEM_BCRCTRL1_RESETVALUE                              0x005E07FFUL                               /**< Default value for MODEM_BCRCTRL1            */
#define _MODEM_BCRCTRL1_MASK                                    0xFFFFFFFFUL                               /**< Mask for MODEM_BCRCTRL1                     */
#define _MODEM_BCRCTRL1_CRGAIN_SHIFT                            0                                          /**< Shift value for MODEM_CRGAIN                */
#define _MODEM_BCRCTRL1_CRGAIN_MASK                             0x7FFUL                                    /**< Bit mask for MODEM_CRGAIN                   */
#define _MODEM_BCRCTRL1_CRGAIN_DEFAULT                          0x000007FFUL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_CRGAIN_DEFAULT                           (_MODEM_BCRCTRL1_CRGAIN_DEFAULT << 0)      /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_CGAINX2                                  (0x1UL << 11)                              /**< CGAINX2                                     */
#define _MODEM_BCRCTRL1_CGAINX2_SHIFT                           11                                         /**< Shift value for MODEM_CGAINX2               */
#define _MODEM_BCRCTRL1_CGAINX2_MASK                            0x800UL                                    /**< Bit mask for MODEM_CGAINX2                  */
#define _MODEM_BCRCTRL1_CGAINX2_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_CGAINX2_DEFAULT                          (_MODEM_BCRCTRL1_CGAINX2_DEFAULT << 11)    /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_RXNCOCOMP                                (0x1UL << 12)                              /**< RXNCOCOMP                                   */
#define _MODEM_BCRCTRL1_RXNCOCOMP_SHIFT                         12                                         /**< Shift value for MODEM_RXNCOCOMP             */
#define _MODEM_BCRCTRL1_RXNCOCOMP_MASK                          0x1000UL                                   /**< Bit mask for MODEM_RXNCOCOMP                */
#define _MODEM_BCRCTRL1_RXNCOCOMP_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_RXNCOCOMP_DEFAULT                        (_MODEM_BCRCTRL1_RXNCOCOMP_DEFAULT << 12)  /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_RXCOMPLAT                                (0x1UL << 13)                              /**< RXCOMPLAT                                   */
#define _MODEM_BCRCTRL1_RXCOMPLAT_SHIFT                         13                                         /**< Shift value for MODEM_RXCOMPLAT             */
#define _MODEM_BCRCTRL1_RXCOMPLAT_MASK                          0x2000UL                                   /**< Bit mask for MODEM_RXCOMPLAT                */
#define _MODEM_BCRCTRL1_RXCOMPLAT_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_RXCOMPLAT_DEFAULT                        (_MODEM_BCRCTRL1_RXCOMPLAT_DEFAULT << 13)  /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_ESCMIDPT                                 (0x1UL << 14)                              /**< ESCMIDPT                                    */
#define _MODEM_BCRCTRL1_ESCMIDPT_SHIFT                          14                                         /**< Shift value for MODEM_ESCMIDPT              */
#define _MODEM_BCRCTRL1_ESCMIDPT_MASK                           0x4000UL                                   /**< Bit mask for MODEM_ESCMIDPT                 */
#define _MODEM_BCRCTRL1_ESCMIDPT_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_ESCMIDPT_DEFAULT                         (_MODEM_BCRCTRL1_ESCMIDPT_DEFAULT << 14)   /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_DISMIDPT                                 (0x1UL << 15)                              /**< DISMIDPT                                    */
#define _MODEM_BCRCTRL1_DISMIDPT_SHIFT                          15                                         /**< Shift value for MODEM_DISMIDPT              */
#define _MODEM_BCRCTRL1_DISMIDPT_MASK                           0x8000UL                                   /**< Bit mask for MODEM_DISMIDPT                 */
#define _MODEM_BCRCTRL1_DISMIDPT_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_DISMIDPT_DEFAULT                         (_MODEM_BCRCTRL1_DISMIDPT_DEFAULT << 15)   /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define _MODEM_BCRCTRL1_BCROSR_SHIFT                            16                                         /**< Shift value for MODEM_BCROSR                */
#define _MODEM_BCRCTRL1_BCROSR_MASK                             0xFFF0000UL                                /**< Bit mask for MODEM_BCROSR                   */
#define _MODEM_BCRCTRL1_BCROSR_DEFAULT                          0x0000005EUL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_BCROSR_DEFAULT                           (_MODEM_BCRCTRL1_BCROSR_DEFAULT << 16)     /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_ESTOSREN                                 (0x1UL << 28)                              /**< ESTOSREN                                    */
#define _MODEM_BCRCTRL1_ESTOSREN_SHIFT                          28                                         /**< Shift value for MODEM_ESTOSREN              */
#define _MODEM_BCRCTRL1_ESTOSREN_MASK                           0x10000000UL                               /**< Bit mask for MODEM_ESTOSREN                 */
#define _MODEM_BCRCTRL1_ESTOSREN_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_ESTOSREN_DEFAULT                         (_MODEM_BCRCTRL1_ESTOSREN_DEFAULT << 28)   /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_BCRSWSYCW                                (0x1UL << 29)                              /**< BCRSWSYCW                                   */
#define _MODEM_BCRCTRL1_BCRSWSYCW_SHIFT                         29                                         /**< Shift value for MODEM_BCRSWSYCW             */
#define _MODEM_BCRCTRL1_BCRSWSYCW_MASK                          0x20000000UL                               /**< Bit mask for MODEM_BCRSWSYCW                */
#define _MODEM_BCRCTRL1_BCRSWSYCW_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_BCRSWSYCW_DEFAULT                        (_MODEM_BCRCTRL1_BCRSWSYCW_DEFAULT << 29)  /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_PHCOMP2FSK                               (0x1UL << 30)                              /**< PHCOMP2FSK                                  */
#define _MODEM_BCRCTRL1_PHCOMP2FSK_SHIFT                        30                                         /**< Shift value for MODEM_PHCOMP2FSK            */
#define _MODEM_BCRCTRL1_PHCOMP2FSK_MASK                         0x40000000UL                               /**< Bit mask for MODEM_PHCOMP2FSK               */
#define _MODEM_BCRCTRL1_PHCOMP2FSK_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_PHCOMP2FSK_DEFAULT                       (_MODEM_BCRCTRL1_PHCOMP2FSK_DEFAULT << 30) /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */
#define MODEM_BCRCTRL1_SLICEFBBYP                               (0x1UL << 31)                              /**< SLICE BYP                                   */
#define _MODEM_BCRCTRL1_SLICEFBBYP_SHIFT                        31                                         /**< Shift value for MODEM_SLICEFBBYP            */
#define _MODEM_BCRCTRL1_SLICEFBBYP_MASK                         0x80000000UL                               /**< Bit mask for MODEM_SLICEFBBYP               */
#define _MODEM_BCRCTRL1_SLICEFBBYP_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_BCRCTRL1             */
#define MODEM_BCRCTRL1_SLICEFBBYP_DEFAULT                       (_MODEM_BCRCTRL1_SLICEFBBYP_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_BCRCTRL1     */

