SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM BCRDEMODOOK */
#define _MODEM_BCRDEMODOOK_RESETVALUE                           0x00A00C03UL                                   /**< Default value for MODEM_BCRDEMODOOK         */
#define _MODEM_BCRDEMODOOK_MASK                                 0xFFFFFFEFUL                                   /**< Mask for MODEM_BCRDEMODOOK                  */
#define MODEM_BCRDEMODOOK_OOKFRZEN                              (0x1UL << 0)                                   /**< OOKFRZEN                                    */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_SHIFT                       0                                              /**< Shift value for MODEM_OOKFRZEN              */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_MASK                        0x1UL                                          /**< Bit mask for MODEM_OOKFRZEN                 */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_DEFAULT                     0x00000001UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_OOKFRZEN_DEFAULT                      (_MODEM_BCRDEMODOOK_OOKFRZEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_RAWGAIN_SHIFT                        1                                              /**< Shift value for MODEM_RAWGAIN               */
#define _MODEM_BCRDEMODOOK_RAWGAIN_MASK                         0x6UL                                          /**< Bit mask for MODEM_RAWGAIN                  */
#define _MODEM_BCRDEMODOOK_RAWGAIN_DEFAULT                      0x00000001UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_RAWGAIN_DEFAULT                       (_MODEM_BCRDEMODOOK_RAWGAIN_DEFAULT << 1)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_NOISEFLEST                            (0x1UL << 3)                                   /**< Noise Floore Estimation Enable              */
#define _MODEM_BCRDEMODOOK_NOISEFLEST_SHIFT                     3                                              /**< Shift value for MODEM_NOISEFLEST            */
#define _MODEM_BCRDEMODOOK_NOISEFLEST_MASK                      0x8UL                                          /**< Bit mask for MODEM_NOISEFLEST               */
#define _MODEM_BCRDEMODOOK_NOISEFLEST_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_NOISEFLEST_DEFAULT                    (_MODEM_BCRDEMODOOK_NOISEFLEST_DEFAULT << 3)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_PKTRUNK                               (0x1UL << 5)                                   /**< PKD TRUNKATION DISABLE                      */
#define _MODEM_BCRDEMODOOK_PKTRUNK_SHIFT                        5                                              /**< Shift value for MODEM_PKTRUNK               */
#define _MODEM_BCRDEMODOOK_PKTRUNK_MASK                         0x20UL                                         /**< Bit mask for MODEM_PKTRUNK                  */
#define _MODEM_BCRDEMODOOK_PKTRUNK_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_PKTRUNK_DEFAULT                       (_MODEM_BCRDEMODOOK_PKTRUNK_DEFAULT << 5)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_MAFREQDWN                             (0x1UL << 6)                                   /**< MAFREQDWN                                   */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_SHIFT                      6                                              /**< Shift value for MODEM_MAFREQDWN             */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_MASK                       0x40UL                                         /**< Bit mask for MODEM_MAFREQDWN                */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_MAFREQDWN_DEFAULT                     (_MODEM_BCRDEMODOOK_MAFREQDWN_DEFAULT << 6)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_SQUELCLKEN                            (0x1UL << 7)                                   /**< Squelch bit clock enable                    */
#define _MODEM_BCRDEMODOOK_SQUELCLKEN_SHIFT                     7                                              /**< Shift value for MODEM_SQUELCLKEN            */
#define _MODEM_BCRDEMODOOK_SQUELCLKEN_MASK                      0x80UL                                         /**< Bit mask for MODEM_SQUELCLKEN               */
#define _MODEM_BCRDEMODOOK_SQUELCLKEN_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_SQUELCLKEN_DEFAULT                    (_MODEM_BCRDEMODOOK_SQUELCLKEN_DEFAULT << 7)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_BWPK_SHIFT                           8                                              /**< Shift value for MODEM_BWPK                  */
#define _MODEM_BCRDEMODOOK_BWPK_MASK                            0x1F00UL                                       /**< Bit mask for MODEM_BWPK                     */
#define _MODEM_BCRDEMODOOK_BWPK_DEFAULT                         0x0000000CUL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_BWPK_DEFAULT                          (_MODEM_BCRDEMODOOK_BWPK_DEFAULT << 8)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_ABPK_SHIFT                           13                                             /**< Shift value for MODEM_ABPK                  */
#define _MODEM_BCRDEMODOOK_ABPK_MASK                            0xE000UL                                       /**< Bit mask for MODEM_ABPK                     */
#define _MODEM_BCRDEMODOOK_ABPK_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_ABPK_DEFAULT                          (_MODEM_BCRDEMODOOK_ABPK_DEFAULT << 13)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_SHIFT                      16                                             /**< Shift value for MODEM_DECAYSWAL             */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_MASK                       0x30000UL                                      /**< Bit mask for MODEM_DECAYSWAL                */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_DECAYSWAL_DEFAULT                     (_MODEM_BCRDEMODOOK_DECAYSWAL_DEFAULT << 16)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_DECAY_SHIFT                          18                                             /**< Shift value for MODEM_DECAY                 */
#define _MODEM_BCRDEMODOOK_DECAY_MASK                           0x3C0000UL                                     /**< Bit mask for MODEM_DECAY                    */
#define _MODEM_BCRDEMODOOK_DECAY_DEFAULT                        0x00000008UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_DECAY_DEFAULT                         (_MODEM_BCRDEMODOOK_DECAY_DEFAULT << 18)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_ATTACK_SHIFT                         22                                             /**< Shift value for MODEM_ATTACK                */
#define _MODEM_BCRDEMODOOK_ATTACK_MASK                          0x1C00000UL                                    /**< Bit mask for MODEM_ATTACK                   */
#define _MODEM_BCRDEMODOOK_ATTACK_DEFAULT                       0x00000002UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_ATTACK_DEFAULT                        (_MODEM_BCRDEMODOOK_ATTACK_DEFAULT << 22)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_SQUELCH_SHIFT                        25                                             /**< Shift value for MODEM_SQUELCH               */
#define _MODEM_BCRDEMODOOK_SQUELCH_MASK                         0xE000000UL                                    /**< Bit mask for MODEM_SQUELCH                  */
#define _MODEM_BCRDEMODOOK_SQUELCH_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_SQUELCH_DEFAULT                       (_MODEM_BCRDEMODOOK_SQUELCH_DEFAULT << 25)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_RAWNDEC_SHIFT                        28                                             /**< Shift value for MODEM_RAWNDEC               */
#define _MODEM_BCRDEMODOOK_RAWNDEC_MASK                         0x70000000UL                                   /**< Bit mask for MODEM_RAWNDEC                  */
#define _MODEM_BCRDEMODOOK_RAWNDEC_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_RAWNDEC_DEFAULT                       (_MODEM_BCRDEMODOOK_RAWNDEC_DEFAULT << 28)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_BCRDEMODOOK                           (0x1UL << 31)                                  /**< BCR Demod OOK enable                        */
#define _MODEM_BCRDEMODOOK_BCRDEMODOOK_SHIFT                    31                                             /**< Shift value for MODEM_BCRDEMODOOK           */
#define _MODEM_BCRDEMODOOK_BCRDEMODOOK_MASK                     0x80000000UL                                   /**< Bit mask for MODEM_BCRDEMODOOK              */
#define _MODEM_BCRDEMODOOK_BCRDEMODOOK_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_BCRDEMODOOK_DEFAULT                   (_MODEM_BCRDEMODOOK_BCRDEMODOOK_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */

/* Bit fields for MODEM BCRDEMODAFC0 */
#define _MODEM_BCRDEMODAFC0_RESETVALUE                          0x40000000UL                                      /**< Default value for MODEM_BCRDEMODAFC0        */
#define _MODEM_BCRDEMODAFC0_MASK                                0xE000807FUL                                      /**< Mask for MODEM_BCRDEMODAFC0                 */
#define _MODEM_BCRDEMODAFC0_ZEROOFF_SHIFT                       0                                                 /**< Shift value for MODEM_ZEROOFF               */
#define _MODEM_BCRDEMODAFC0_ZEROOFF_MASK                        0x7FUL                                            /**< Bit mask for MODEM_ZEROOFF                  */
#define _MODEM_BCRDEMODAFC0_ZEROOFF_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_ZEROOFF_DEFAULT                      (_MODEM_BCRDEMODAFC0_ZEROOFF_DEFAULT << 0)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_LARGEFREQERR                         (0x1UL << 15)                                     /**< LARGEFREQERR                                */
#define _MODEM_BCRDEMODAFC0_LARGEFREQERR_SHIFT                  15                                                /**< Shift value for MODEM_LARGEFREQERR          */
#define _MODEM_BCRDEMODAFC0_LARGEFREQERR_MASK                   0x8000UL                                          /**< Bit mask for MODEM_LARGEFREQERR             */
#define _MODEM_BCRDEMODAFC0_LARGEFREQERR_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_LARGEFREQERR_DEFAULT                 (_MODEM_BCRDEMODAFC0_LARGEFREQERR_DEFAULT << 15)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_AFCGAINOVRFLW                        (0x1UL << 29)                                     /**< AFCGAINOVRFLW                               */
#define _MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_SHIFT                 29                                                /**< Shift value for MODEM_AFCGAINOVRFLW         */
#define _MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_MASK                  0x20000000UL                                      /**< Bit mask for MODEM_AFCGAINOVRFLW            */
#define _MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_DEFAULT                (_MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_DEFAULT << 29) /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_EN2TBEST                             (0x1UL << 30)                                     /**< EN2TBEST                                    */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_SHIFT                      30                                                /**< Shift value for MODEM_EN2TBEST              */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_MASK                       0x40000000UL                                      /**< Bit mask for MODEM_EN2TBEST                 */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_DEFAULT                    0x00000001UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_EN2TBEST_DEFAULT                     (_MODEM_BCRDEMODAFC0_EN2TBEST_DEFAULT << 30)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_ENAFCCLKSW                           (0x1UL << 31)                                     /**< ENAFCCLKSW                                  */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_SHIFT                    31                                                /**< Shift value for MODEM_ENAFCCLKSW            */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_MASK                     0x80000000UL                                      /**< Bit mask for MODEM_ENAFCCLKSW               */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_DEFAULT                  0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_ENAFCCLKSW_DEFAULT                   (_MODEM_BCRDEMODAFC0_ENAFCCLKSW_DEFAULT << 31)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */

