SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM BCRDEMOD4FSK0 */
#define _MODEM_BCRDEMOD4FSK0_RESETVALUE                         0x00B4299AUL                                   /**< Default value for MODEM_BCRDEMOD4FSK0       */
#define _MODEM_BCRDEMOD4FSK0_MASK                               0xC0FFFFFFUL                                   /**< Mask for MODEM_BCRDEMOD4FSK0                */
#define _MODEM_BCRDEMOD4FSK0_THD4GFSK_SHIFT                     0                                              /**< Shift value for MODEM_THD4GFSK              */
#define _MODEM_BCRDEMOD4FSK0_THD4GFSK_MASK                      0xFFFFUL                                       /**< Bit mask for MODEM_THD4GFSK                 */
#define _MODEM_BCRDEMOD4FSK0_THD4GFSK_DEFAULT                   0x0000299AUL                                   /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK0        */
#define MODEM_BCRDEMOD4FSK0_THD4GFSK_DEFAULT                    (_MODEM_BCRDEMOD4FSK0_THD4GFSK_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK0*/
#define _MODEM_BCRDEMOD4FSK0_CODE4GFSK_SHIFT                    16                                             /**< Shift value for MODEM_CODE4GFSK             */
#define _MODEM_BCRDEMOD4FSK0_CODE4GFSK_MASK                     0xFF0000UL                                     /**< Bit mask for MODEM_CODE4GFSK                */
#define _MODEM_BCRDEMOD4FSK0_CODE4GFSK_DEFAULT                  0x000000B4UL                                   /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK0        */
#define MODEM_BCRDEMOD4FSK0_CODE4GFSK_DEFAULT                   (_MODEM_BCRDEMOD4FSK0_CODE4GFSK_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK0*/
#define MODEM_BCRDEMOD4FSK0_PHCOMPBYP                           (0x1UL << 30)                                  /**< PHCOMPBYP                                   */
#define _MODEM_BCRDEMOD4FSK0_PHCOMPBYP_SHIFT                    30                                             /**< Shift value for MODEM_PHCOMPBYP             */
#define _MODEM_BCRDEMOD4FSK0_PHCOMPBYP_MASK                     0x40000000UL                                   /**< Bit mask for MODEM_PHCOMPBYP                */
#define _MODEM_BCRDEMOD4FSK0_PHCOMPBYP_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK0        */
#define MODEM_BCRDEMOD4FSK0_PHCOMPBYP_DEFAULT                   (_MODEM_BCRDEMOD4FSK0_PHCOMPBYP_DEFAULT << 30) /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK0*/
#define MODEM_BCRDEMOD4FSK0_EN4GFSK                             (0x1UL << 31)                                  /**< Enable BCR demod 4GFSK                      */
#define _MODEM_BCRDEMOD4FSK0_EN4GFSK_SHIFT                      31                                             /**< Shift value for MODEM_EN4GFSK               */
#define _MODEM_BCRDEMOD4FSK0_EN4GFSK_MASK                       0x80000000UL                                   /**< Bit mask for MODEM_EN4GFSK                  */
#define _MODEM_BCRDEMOD4FSK0_EN4GFSK_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK0        */
#define MODEM_BCRDEMOD4FSK0_EN4GFSK_DEFAULT                     (_MODEM_BCRDEMOD4FSK0_EN4GFSK_DEFAULT << 31)   /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK0*/

/* Bit fields for MODEM BCRDEMOD4FSK1 */
#define _MODEM_BCRDEMOD4FSK1_RESETVALUE                         0x00000B1CUL                                       /**< Default value for MODEM_BCRDEMOD4FSK1       */
#define _MODEM_BCRDEMOD4FSK1_MASK                               0xC0FF7F7FUL                                       /**< Mask for MODEM_BCRDEMOD4FSK1                */
#define _MODEM_BCRDEMOD4FSK1_PHCOMP4FSK0_SHIFT                  0                                                  /**< Shift value for MODEM_PHCOMP4FSK0           */
#define _MODEM_BCRDEMOD4FSK1_PHCOMP4FSK0_MASK                   0x7FUL                                             /**< Bit mask for MODEM_PHCOMP4FSK0              */
#define _MODEM_BCRDEMOD4FSK1_PHCOMP4FSK0_DEFAULT                0x0000001CUL                                       /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK1        */
#define MODEM_BCRDEMOD4FSK1_PHCOMP4FSK0_DEFAULT                 (_MODEM_BCRDEMOD4FSK1_PHCOMP4FSK0_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK1*/
#define _MODEM_BCRDEMOD4FSK1_PHCOMP4FSK1_SHIFT                  8                                                  /**< Shift value for MODEM_PHCOMP4FSK1           */
#define _MODEM_BCRDEMOD4FSK1_PHCOMP4FSK1_MASK                   0x7F00UL                                           /**< Bit mask for MODEM_PHCOMP4FSK1              */
#define _MODEM_BCRDEMOD4FSK1_PHCOMP4FSK1_DEFAULT                0x0000000BUL                                       /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK1        */
#define MODEM_BCRDEMOD4FSK1_PHCOMP4FSK1_DEFAULT                 (_MODEM_BCRDEMOD4FSK1_PHCOMP4FSK1_DEFAULT << 8)    /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK1*/
#define _MODEM_BCRDEMOD4FSK1_FDEVCOMPRATIO_SHIFT                16                                                 /**< Shift value for MODEM_FDEVCOMPRATIO         */
#define _MODEM_BCRDEMOD4FSK1_FDEVCOMPRATIO_MASK                 0x7F0000UL                                         /**< Bit mask for MODEM_FDEVCOMPRATIO            */
#define _MODEM_BCRDEMOD4FSK1_FDEVCOMPRATIO_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK1        */
#define MODEM_BCRDEMOD4FSK1_FDEVCOMPRATIO_DEFAULT               (_MODEM_BCRDEMOD4FSK1_FDEVCOMPRATIO_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK1*/
#define MODEM_BCRDEMOD4FSK1_FDEVCOMPEN                          (0x1UL << 23)                                      /**< Freq. Dev. Comp. Enable                     */
#define _MODEM_BCRDEMOD4FSK1_FDEVCOMPEN_SHIFT                   23                                                 /**< Shift value for MODEM_FDEVCOMPEN            */
#define _MODEM_BCRDEMOD4FSK1_FDEVCOMPEN_MASK                    0x800000UL                                         /**< Bit mask for MODEM_FDEVCOMPEN               */
#define _MODEM_BCRDEMOD4FSK1_FDEVCOMPEN_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK1        */
#define MODEM_BCRDEMOD4FSK1_FDEVCOMPEN_DEFAULT                  (_MODEM_BCRDEMOD4FSK1_FDEVCOMPEN_DEFAULT << 23)    /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK1*/
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_SHIFT                       30                                                 /**< Shift value for MODEM_S2PMAP                */
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_MASK                        0xC0000000UL                                       /**< Bit mask for MODEM_S2PMAP                   */
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_DEFAULT                     0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMOD4FSK1        */
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping0                0x00000000UL                                       /**< Mode S2p_mapping0 for MODEM_BCRDEMOD4FSK1   */
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping1                0x00000001UL                                       /**< Mode S2p_mapping1 for MODEM_BCRDEMOD4FSK1   */
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping2                0x00000002UL                                       /**< Mode S2p_mapping2 for MODEM_BCRDEMOD4FSK1   */
#define _MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping3                0x00000003UL                                       /**< Mode S2p_mapping3 for MODEM_BCRDEMOD4FSK1   */
#define MODEM_BCRDEMOD4FSK1_S2PMAP_DEFAULT                      (_MODEM_BCRDEMOD4FSK1_S2PMAP_DEFAULT << 30)        /**< Shifted mode DEFAULT for MODEM_BCRDEMOD4FSK1*/
#define MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping0                 (_MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping0 << 30)   /**< Shifted mode S2p_mapping0 for MODEM_BCRDEMOD4FSK1*/
#define MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping1                 (_MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping1 << 30)   /**< Shifted mode S2p_mapping1 for MODEM_BCRDEMOD4FSK1*/
#define MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping2                 (_MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping2 << 30)   /**< Shifted mode S2p_mapping2 for MODEM_BCRDEMOD4FSK1*/
#define MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping3                 (_MODEM_BCRDEMOD4FSK1_S2PMAP_S2p_mapping3 << 30)   /**< Shifted mode S2p_mapping3 for MODEM_BCRDEMOD4FSK1*/

/* Bit fields for MODEM BCRDEMODANT */
#define _MODEM_BCRDEMODANT_RESETVALUE                           0x10020000UL                                      /**< Default value for MODEM_BCRDEMODANT         */
#define _MODEM_BCRDEMODANT_MASK                                 0x9FFF97E0UL                                      /**< Mask for MODEM_BCRDEMODANT                  */
#define _MODEM_BCRDEMODANT_SWANTTIMER_SHIFT                     5                                                 /**< Shift value for MODEM_SWANTTIMER            */
#define _MODEM_BCRDEMODANT_SWANTTIMER_MASK                      0x7E0UL                                           /**< Bit mask for MODEM_SWANTTIMER               */
#define _MODEM_BCRDEMODANT_SWANTTIMER_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_SWANTTIMER_DEFAULT                    (_MODEM_BCRDEMODANT_SWANTTIMER_DEFAULT << 5)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define MODEM_BCRDEMODANT_BECOEN                                (0x1UL << 12)                                     /**< BECO MODE Enable                            */
#define _MODEM_BCRDEMODANT_BECOEN_SHIFT                         12                                                /**< Shift value for MODEM_BECOEN                */
#define _MODEM_BCRDEMODANT_BECOEN_MASK                          0x1000UL                                          /**< Bit mask for MODEM_BECOEN                   */
#define _MODEM_BCRDEMODANT_BECOEN_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_BECOEN_DEFAULT                        (_MODEM_BCRDEMODANT_BECOEN_DEFAULT << 12)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define MODEM_BCRDEMODANT_SKIP2PHTHD                            (0x1UL << 15)                                     /**< SKIP2PHTHD                                  */
#define _MODEM_BCRDEMODANT_SKIP2PHTHD_SHIFT                     15                                                /**< Shift value for MODEM_SKIP2PHTHD            */
#define _MODEM_BCRDEMODANT_SKIP2PHTHD_MASK                      0x8000UL                                          /**< Bit mask for MODEM_SKIP2PHTHD               */
#define _MODEM_BCRDEMODANT_SKIP2PHTHD_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_SKIP2PHTHD_DEFAULT                    (_MODEM_BCRDEMODANT_SKIP2PHTHD_DEFAULT << 15)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define _MODEM_BCRDEMODANT_ANWAIT_SHIFT                         16                                                /**< Shift value for MODEM_ANWAIT                */
#define _MODEM_BCRDEMODANT_ANWAIT_MASK                          0x3F0000UL                                        /**< Bit mask for MODEM_ANWAIT                   */
#define _MODEM_BCRDEMODANT_ANWAIT_DEFAULT                       0x00000002UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_ANWAIT_DEFAULT                        (_MODEM_BCRDEMODANT_ANWAIT_DEFAULT << 16)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define MODEM_BCRDEMODANT_AGCGAINUPB                            (0x1UL << 22)                                     /**< AGC GAIN UP                                 */
#define _MODEM_BCRDEMODANT_AGCGAINUPB_SHIFT                     22                                                /**< Shift value for MODEM_AGCGAINUPB            */
#define _MODEM_BCRDEMODANT_AGCGAINUPB_MASK                      0x400000UL                                        /**< Bit mask for MODEM_AGCGAINUPB               */
#define _MODEM_BCRDEMODANT_AGCGAINUPB_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_AGCGAINUPB_DEFAULT                    (_MODEM_BCRDEMODANT_AGCGAINUPB_DEFAULT << 22)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define MODEM_BCRDEMODANT_SKIP2PH                               (0x1UL << 23)                                     /**< SKIP2PH                                     */
#define _MODEM_BCRDEMODANT_SKIP2PH_SHIFT                        23                                                /**< Shift value for MODEM_SKIP2PH               */
#define _MODEM_BCRDEMODANT_SKIP2PH_MASK                         0x800000UL                                        /**< Bit mask for MODEM_SKIP2PH                  */
#define _MODEM_BCRDEMODANT_SKIP2PH_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_SKIP2PH_DEFAULT                       (_MODEM_BCRDEMODANT_SKIP2PH_DEFAULT << 23)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define MODEM_BCRDEMODANT_BYP1P5                                (0x1UL << 24)                                     /**< BYP1P5                                      */
#define _MODEM_BCRDEMODANT_BYP1P5_SHIFT                         24                                                /**< Shift value for MODEM_BYP1P5                */
#define _MODEM_BCRDEMODANT_BYP1P5_MASK                          0x1000000UL                                       /**< Bit mask for MODEM_BYP1P5                   */
#define _MODEM_BCRDEMODANT_BYP1P5_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_BYP1P5_DEFAULT                        (_MODEM_BCRDEMODANT_BYP1P5_DEFAULT << 24)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define _MODEM_BCRDEMODANT_ANT2PMTHD_SHIFT                      25                                                /**< Shift value for MODEM_ANT2PMTHD             */
#define _MODEM_BCRDEMODANT_ANT2PMTHD_MASK                       0x1E000000UL                                      /**< Bit mask for MODEM_ANT2PMTHD                */
#define _MODEM_BCRDEMODANT_ANT2PMTHD_DEFAULT                    0x00000008UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_ANT2PMTHD_DEFAULT                     (_MODEM_BCRDEMODANT_ANT2PMTHD_DEFAULT << 25)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */
#define MODEM_BCRDEMODANT_BCRDEMODANTDIV                        (0x1UL << 31)                                     /**< BCRDEMODANTDIV                              */
#define _MODEM_BCRDEMODANT_BCRDEMODANTDIV_SHIFT                 31                                                /**< Shift value for MODEM_BCRDEMODANTDIV        */
#define _MODEM_BCRDEMODANT_BCRDEMODANTDIV_MASK                  0x80000000UL                                      /**< Bit mask for MODEM_BCRDEMODANTDIV           */
#define _MODEM_BCRDEMODANT_BCRDEMODANTDIV_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODANT          */
#define MODEM_BCRDEMODANT_BCRDEMODANTDIV_DEFAULT                (_MODEM_BCRDEMODANT_BCRDEMODANTDIV_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_BCRDEMODANT  */

