SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_modem.h
/* Bit fields for MODEM BCRDEMODKSI */
#define _MODEM_BCRDEMODKSI_RESETVALUE                           0x002C2020UL                               /**< Default value for MODEM_BCRDEMODKSI         */
#define _MODEM_BCRDEMODKSI_MASK                                 0x007F7F7FUL                               /**< Mask for MODEM_BCRDEMODKSI                  */
#define _MODEM_BCRDEMODKSI_BCRKSI1_SHIFT                        0                                          /**< Shift value for MODEM_BCRKSI1               */
#define _MODEM_BCRDEMODKSI_BCRKSI1_MASK                         0x7FUL                                     /**< Bit mask for MODEM_BCRKSI1                  */
#define _MODEM_BCRDEMODKSI_BCRKSI1_DEFAULT                      0x00000020UL                               /**< Mode DEFAULT for MODEM_BCRDEMODKSI          */
#define MODEM_BCRDEMODKSI_BCRKSI1_DEFAULT                       (_MODEM_BCRDEMODKSI_BCRKSI1_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODKSI  */
#define _MODEM_BCRDEMODKSI_BCRKSI2_SHIFT                        8                                          /**< Shift value for MODEM_BCRKSI2               */
#define _MODEM_BCRDEMODKSI_BCRKSI2_MASK                         0x7F00UL                                   /**< Bit mask for MODEM_BCRKSI2                  */
#define _MODEM_BCRDEMODKSI_BCRKSI2_DEFAULT                      0x00000020UL                               /**< Mode DEFAULT for MODEM_BCRDEMODKSI          */
#define MODEM_BCRDEMODKSI_BCRKSI2_DEFAULT                       (_MODEM_BCRDEMODKSI_BCRKSI2_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODKSI  */
#define _MODEM_BCRDEMODKSI_BCRKSI3_SHIFT                        16                                         /**< Shift value for MODEM_BCRKSI3               */
#define _MODEM_BCRDEMODKSI_BCRKSI3_MASK                         0x7F0000UL                                 /**< Bit mask for MODEM_BCRKSI3                  */
#define _MODEM_BCRDEMODKSI_BCRKSI3_DEFAULT                      0x0000002CUL                               /**< Mode DEFAULT for MODEM_BCRDEMODKSI          */
#define MODEM_BCRDEMODKSI_BCRKSI3_DEFAULT                       (_MODEM_BCRDEMODKSI_BCRKSI3_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_BCRDEMODKSI  */

/* Bit fields for MODEM BCRDEMODPMEXP */
#define _MODEM_BCRDEMODPMEXP_RESETVALUE                         0x58965555UL                                       /**< Default value for MODEM_BCRDEMODPMEXP       */
#define _MODEM_BCRDEMODPMEXP_MASK                               0xFEFFFFFFUL                                       /**< Mask for MODEM_BCRDEMODPMEXP                */
#define _MODEM_BCRDEMODPMEXP_BCRPMEXP_SHIFT                     0                                                  /**< Shift value for MODEM_BCRPMEXP              */
#define _MODEM_BCRDEMODPMEXP_BCRPMEXP_MASK                      0xFFFFUL                                           /**< Bit mask for MODEM_BCRPMEXP                 */
#define _MODEM_BCRDEMODPMEXP_BCRPMEXP_DEFAULT                   0x00005555UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODPMEXP        */
#define MODEM_BCRDEMODPMEXP_BCRPMEXP_DEFAULT                    (_MODEM_BCRDEMODPMEXP_BCRPMEXP_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODPMEXP*/
#define _MODEM_BCRDEMODPMEXP_BCRCFECOSTTHD_SHIFT                16                                                 /**< Shift value for MODEM_BCRCFECOSTTHD         */
#define _MODEM_BCRDEMODPMEXP_BCRCFECOSTTHD_MASK                 0xFF0000UL                                         /**< Bit mask for MODEM_BCRCFECOSTTHD            */
#define _MODEM_BCRDEMODPMEXP_BCRCFECOSTTHD_DEFAULT              0x00000096UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODPMEXP        */
#define MODEM_BCRDEMODPMEXP_BCRCFECOSTTHD_DEFAULT               (_MODEM_BCRDEMODPMEXP_BCRCFECOSTTHD_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_BCRDEMODPMEXP*/
#define _MODEM_BCRDEMODPMEXP_BCRPHSCALE_SHIFT                   25                                                 /**< Shift value for MODEM_BCRPHSCALE            */
#define _MODEM_BCRDEMODPMEXP_BCRPHSCALE_MASK                    0x6000000UL                                        /**< Bit mask for MODEM_BCRPHSCALE               */
#define _MODEM_BCRDEMODPMEXP_BCRPHSCALE_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODPMEXP        */
#define MODEM_BCRDEMODPMEXP_BCRPHSCALE_DEFAULT                  (_MODEM_BCRDEMODPMEXP_BCRPHSCALE_DEFAULT << 25)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODPMEXP*/
#define _MODEM_BCRDEMODPMEXP_BCRCFESCHWIN_SHIFT                 27                                                 /**< Shift value for MODEM_BCRCFESCHWIN          */
#define _MODEM_BCRDEMODPMEXP_BCRCFESCHWIN_MASK                  0x38000000UL                                       /**< Bit mask for MODEM_BCRCFESCHWIN             */
#define _MODEM_BCRDEMODPMEXP_BCRCFESCHWIN_DEFAULT               0x00000003UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODPMEXP        */
#define MODEM_BCRDEMODPMEXP_BCRCFESCHWIN_DEFAULT                (_MODEM_BCRDEMODPMEXP_BCRCFESCHWIN_DEFAULT << 27)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODPMEXP*/
#define _MODEM_BCRDEMODPMEXP_BCRPMACQWIN_SHIFT                  30                                                 /**< Shift value for MODEM_BCRPMACQWIN           */
#define _MODEM_BCRDEMODPMEXP_BCRPMACQWIN_MASK                   0xC0000000UL                                       /**< Bit mask for MODEM_BCRPMACQWIN              */
#define _MODEM_BCRDEMODPMEXP_BCRPMACQWIN_DEFAULT                0x00000001UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODPMEXP        */
#define MODEM_BCRDEMODPMEXP_BCRPMACQWIN_DEFAULT                 (_MODEM_BCRDEMODPMEXP_BCRPMACQWIN_DEFAULT << 30)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODPMEXP*/

/* Bit fields for MODEM SPARE */
#define _MODEM_SPARE_RESETVALUE                                 0x00000000UL                      /**< Default value for MODEM_SPARE               */
#define _MODEM_SPARE_MASK                                       0x000000FFUL                      /**< Mask for MODEM_SPARE                        */
#define _MODEM_SPARE_SPARE_SHIFT                                0                                 /**< Shift value for MODEM_SPARE                 */
#define _MODEM_SPARE_SPARE_MASK                                 0xFFUL                            /**< Bit mask for MODEM_SPARE                    */
#define _MODEM_SPARE_SPARE_DEFAULT                              0x00000000UL                      /**< Mode DEFAULT for MODEM_SPARE                */
#define MODEM_SPARE_SPARE_DEFAULT                               (_MODEM_SPARE_SPARE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_SPARE        */

/** @} End of group ZGM23_MODEM_BitFields */
/** @} End of group ZGM23_MODEM */
/** @} End of group Parts */

#endif /* ZGM23_MODEM_H */
